uat_chat/Documents/РеестрНаПеревозку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>РеестрНаПеревозку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РаботаТС</xr:Item>
				<xr:Item>AccumulationRegister.РаботаВодителей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправления</Name>
					<Comment>Адрес отправления</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыПогрузкиРазгрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДорог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДорог</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Задание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутевойЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЕздок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПрибытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяУбытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоТонн</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦехКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦехаКонтрагента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Comment>Объем, м3</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемКузова</Name>
							<Comment>Объем, м3</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузоподъемность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расстояние</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

uat_chat/AccumulationRegisters/РаботаТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>РаботаТС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Талон</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Comment>ТС или оборудование</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прейскурант</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Пробег, оплачиваемый Заказчиком</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тонны</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТнКм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробегСГрузом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасовСдел</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДорог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДорог</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реестр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеестрНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦехКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦехаКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробегОбщий</Name>
					<Comment>Пробег, распределенный на Заказчика</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

uat_chat/Documents/РеестрНаПеревозку/Ext/ObjectModule.bsl
Процедура ОчиститьПЛ(ДокМас=Неопределено)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	уатПутевойЛистРабота.Ссылка,
	               |	уатПутевойЛистРабота.ИдСтроки,
				   |    ""Работа"" ИмяТаблицы
	               |ИЗ
	               |	Документ.уатПутевойЛист.Работа КАК уатПутевойЛистРабота
	               |ГДЕ
	               |	уатПутевойЛистРабота.Реестр = &сс
				   |  и ИдСтроки NOT IN (&Мас)
				   |
				   | UNION ALL
				   |
				   |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	уатПутевойЛистРабота.Ссылка,
	               |	уатПутевойЛистРабота.ИдСтроки,
				   |    ""Задание"" ИмяТаблицы
	               |ИЗ
	               |	Документ.уатПутевойЛист.Задание КАК уатПутевойЛистРабота
	               |ГДЕ
	               |	уатПутевойЛистРабота.Реестр = &сс
				   |  и ИдСтроки NOT IN (&МасКА)
				   |";
				   Запрос.УстановитьПараметр("сс",ссылка);
				   Если ДокМас=Неопределено ТОгда
						Запрос.УстановитьПараметр("Мас",999999999);   
						Запрос.УстановитьПараметр("МасКА",999999999);   
					ИНачеЕсли ЗначениеЗаполнено(Контрагент) ТОгда
						Запрос.УстановитьПараметр("Мас",999999999);   
						Запрос.УстановитьПараметр("МасКА",ДокМас);   
					ИНаче
						Запрос.УстановитьПараметр("Мас",ДокМас);   
						Запрос.УстановитьПараметр("МасКА",999999999);   
				   КонецеСЛИ;
				   
				   ТБл = Запрос.Выполнить().Выгрузить();

	Для каждого стр из Тбл Цикл
					   
		Обк = Стр.ссылка.ПолучитьОбъект();
		МАс = Обк[Стр.ИмяТаблицы].НайтиСтроки(Новый Структура("Реестр,идСтроки",Ссылка,Стр.ИдСтроки));
		ДЛя каждого Эл из Мас Цикл
			Обк[Стр.ИмяТаблицы].Удалить(Эл);
		КонецЦИкла;
		
		Состояние("Удалена строка из "+Обк);
		Если Обк.Проведен ТОгда
			Обк.Записать(РежимЗаписиДокумента.Проведение);
		ИНаче
			Обк.Записать(РежимЗаписиДокумента.Запись);
		КонецеСЛИ;
		
	КонецЦикла;			   
	
	
КонецПроцедуры	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗначениеЗаполнено(Контрагент) и ЗначениеЗаполнено(Подразделение) ТОгда
		Сообщить("Нельзя выбирать контрагента и подразделение одновременно в одном документе!");
		Отказ=Истина;
		Возврат;
	КонецЕСЛИ;
	
	Если ЭтоНовый() Тогда
		Создал = ПараметрыСеанса.ТекущийПользователь;
	КонецЕСЛИ;
	
	Если (РежимЗаписи = РежимЗаписиДокумента.Запись и ПометкаУдаления) или
		 (РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) ТОгда
		ОчиститьПЛ();	
	КонецеСЛИ;
	
	//Проверим строку на уникальность!
	Если Задание.Количество()<>0 Тогда
		Т=Задание.Выгрузить(,"ИдСтроки");
		Т.Сортировать("ИдСтроки Desc");
		М=Т[0].ИдСтроки;
		Для каждого Стр из Задание Цикл
			Если Стр.ИдСтроки = 0 Тогда
				М=М+1;
				Стр.ИдСтроки = М;
			КонецЕСЛИ;
		КонецЦикла;
		
		Т = Задание.Выгрузить(,"ИдСтроки");
		Т.Колонки.Добавить("Инд");
		Т.ЗаполнитьЗначения(1,"инд");
		Т.Свернуть("ИдСтроки","инд");
		Для каждого стр из Т Цикл
			Если Стр.Инд<>1 ТОгда
				Сообщить("Ошибка уникальности строки!");
				Отказ = Истина;
				ВозвраТ;
			КонецЕСЛИ;
		КонецЦикла;
	КонецЕСЛИ;
	
КонецПроцедуры

Процедура ПровестиРаботаТС(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |    РеестрНаПеревозкуПЛ.ПутевойЛист.Дата Период,
				   |    Значение(ВидДвиженияНакопления.Приход) ВидДвижения,
	               |	CASE WHEN Ссылка.ОбъектСтроительства = Значение(Справочник.уатОбъектыСтроительства.ПустаяСсылка) THEN РеестрНаПеревозкуПЛ.Ссылка.Контрагент ELSE NULL END Контрагент,
	               |	CASE WHEN Ссылка.ОбъектСтроительства = Значение(Справочник.уатОбъектыСтроительства.ПустаяСсылка) THEN РеестрНаПеревозкуПЛ.ЦехКонтрагента ELSE NULL END ЦехКонтрагента,
	               |	CASE WHEN Ссылка.ОбъектСтроительства = Значение(Справочник.уатОбъектыСтроительства.ПустаяСсылка) THEN 1 ELSE 0 END Талон,
	               |	РеестрНаПеревозкуПЛ.ПутевойЛист,
	               |	РеестрНаПеревозкуПЛ.ИдСтроки,
				   |	РеестрНаПеревозкуПЛ.КоличествоЧасов,
				   |	РеестрНаПеревозкуПЛ.ПутевойЛист.ТранспортноеСредство ТС,
	               |	РеестрНаПеревозкуПЛ.Расстояние*КоличествоЕздок ПробегСдел,
				   |	РеестрНаПеревозкуПЛ.Объем,
				   |	РеестрНаПеревозкуПЛ.КоличествоТонн Тонны,
				   |	РеестрНаПеревозкуПЛ.КоличествоТонн*РеестрНаПеревозкуПЛ.Расстояние*КоличествоЕздок ТнКм,
				   |	РеестрНаПеревозкуПЛ.КоличествоЕздок Ездки,
	               |	РеестрНаПеревозкуПЛ.Ссылка.Услуга Номенклатура,
	               |	РеестрНаПеревозкуПЛ.Ссылка.Груз,
	               |	РеестрНаПеревозкуПЛ.Ссылка.Подразделение,
	               |	РеестрНаПеревозкуПЛ.Ссылка.ОбъектСтроительства Объект
	               |ИЗ
	               |	Документ.РеестрНаПеревозку.Задание КАК РеестрНаПеревозкуПЛ
	               |ГДЕ
	               |	РеестрНаПеревозкуПЛ.Ссылка = &сс";
				   Запрос.УстановитьПараметр("сс",ссылка);
				   
				Движения.РаботаТС.Загрузить(Запрос.Выполнить().Выгрузить());
				Движения.РаботаТС.Записать();
	
			КонецПроцедуры
			
Процедура ПровестиРаботаВодителей(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |    РеестрНаПеревозку.Ссылка Регистратор,	
				   |    РеестрНаПеревозку.Дата Период,	
				   |    РеестрНаПеревозку.Дата ДатаРаботы,	
				   |    НачалоПериода(РеестрНаПеревозку.Дата,Месяц) ПериодРаботы,	
				   |    Значение(ПланВидовРасчета.уатОсновныеНачисления.СдельнаяОплата) ВидРасчета,	
	               |	CASE WHEN РеестрНаПеревозку.Контрагент = Значение(Справочник.Контрагенты.ПустаяСсылка) THEN РеестрНаПеревозку.Подразделение ELSE Контрагент END Контрагент,
	               |	CASE WHEN РеестрНаПеревозку.Контрагент = Значение(Справочник.Контрагенты.ПустаяСсылка) THEN РеестрНаПеревозку.ОбъектСтроительства ELSE РеестрНаПеревозкуЗадание.ЦехКонтрагента END ЦехКонтрагента,
	               |	РеестрНаПеревозку.Услуга Номенклатура,
	               |	РеестрНаПеревозкуЗадание.ПутевойЛист.Водитель1 Водитель,
	               |	РеестрНаПеревозкуЗадание.ПутевойЛист КПутевомуЛисту,
	               |	РеестрНаПеревозкуЗадание.ПутевойЛист.ТранспортноеСредство ТС,
	               |	ISNULL(ГруппыДорогМодели.Тариф,0)*60/CASE WHEN ISNULL(ГруппыДорогМодели.НормаВремени,0)<>0 THEN ГруппыДорогМодели.НормаВремени ELSE 1 END тариф,
	               |	ISNULL(СпособыПогрузкиРазгрузкиМодели.Тариф,0) тарифПР,
	               |	РеестрНаПеревозкуЗадание.КоличествоТонн*Расстояние*ISNULL(ГруппыДорогМодели.Тариф,0)+
				   |    РеестрНаПеревозкуЗадание.КоличествоТонн*ISNULL(СпособыПогрузкиРазгрузкиМодели.Тариф,0) Сумма,
				   
				   |    CASE WHEN Ссылка.ГруппаДорог.Скорость <> 0 
			   		|        THEN (Расстояние * КоличествоЕздок * 2) / Ссылка.ГруппаДорог.Скорость + СпособыПогрузкиРазгрузкиМодели.НормаВремени * КоличествоЕздок 
			   		|		ELSE 0 END НормаЧасовПоСделке
				   
	               |ИЗ
	               |	Документ.РеестрНаПеревозку.Задание КАК РеестрНаПеревозкуЗадание
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеестрНаПеревозку КАК РеестрНаПеревозку
	               |			ПО РеестрНаПеревозкуЗадание.Ссылка = РеестрНаПеревозку.Ссылка и РеестрНаПеревозку.Ссылка = &сс
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДорог.Модели КАК ГруппыДорогМодели
	               |			ПО РеестрНаПеревозку.ГруппаДорог = ГруппыДорогМодели.Ссылка
				   | 			 и РеестрНаПеревозкуЗадание.ПутевойЛист.ТранспортноеСредство.Модель = ГруппыДорогМодели.Модель
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыПогрузкиРазгрузки.Модели КАК СпособыПогрузкиРазгрузкиМодели
	               |			ПО РеестрНаПеревозку.СпособПогрузки = СпособыПогрузкиРазгрузкиМодели.Ссылка
				   | 			 и РеестрНаПеревозкуЗадание.ПутевойЛист.ТранспортноеСредство.Модель = СпособыПогрузкиРазгрузкиМодели.Модель
                   |";
				   Запрос.УстановитьПараметр("сс",Ссылка);
				   ТБл = Запрос.Выполнить().Выгрузить();
				   ДЛя каждого стр из Тбл Цикл
					   Если Стр.Тариф = 0 ТОгда
						   Сообщить("НЕТ тарифа на Тн/км для "+Стр.тс);
						   //Отказ = Истина;
					   КонецеСЛИ;
					   Если Стр.ТарифПР = 0 ТОгда
						   Сообщить("НЕТ тарифа на ПРР для "+Стр.тс);
						   //Отказ = Истина;
					   КонецеСЛИ;
				   КонецЦикла;
				   
				   
				   Рег = Движения.РаботаВодителей;
				   Рег.Записывать = Истина;
				   Рег.Загрузить(ТБл);


КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		Обработал = ПараметрыСеанса.ТекущийПользователь;
		//ПровестиРаботаТС(Отказ);
		
		ПровестиРаботаВодителей(Отказ);
		
		ЧасыСдел = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация, ПланыВидовХарактеристик.уатПраваИНастройки.ПродолжительностьРабДняПриСделке);
		
		ОчиститьПЛ(Задание.ВыгрузитьКолонку("ИдСтроки"));
		Для каждого стр из Задание Цикл
			Обк = Стр.ПутевойЛист.ПолучитьОбъект();
			
			Если ЗначениеЗаполнено(Контрагент) ТОгда
				ОбкТаб = Обк.Задание;	
			ИНаче
				ОбкТаб = Обк.Работа;
			КонецЕСЛИ;
			
			Мас = ОбкТаб.НайтиСтроки(Новый Структура("Реестр,идСтроки",Ссылка,Стр.ИдСтроки));
			Если Мас.Количество()>1 ТОгда
				ДЛя а=1 по Мас.Количество()-1 Цикл
					ОбкТаб.Удалить(МАс[а]);
				КонецЦикла;
			ИНачеЕсли Мас.Количество()=0 ТОгда
				ТекСтр = ОбкТаб.Добавить();
			ИНАче
				ТекСтр = Мас[0];
			КонецеСЛИ;
			
			ТекСтр.КоличествоЕздок = Стр.КоличествоЕздок;
			ТекСтр.КоличествоКмГруз= Стр.Расстояние;
			ТекСтр.ОбъектСтроительства = Ссылка.ОбъектСтроительства;
			ТекСтр.Подразделение  = Ссылка.Подразделение;
			ТекСтр.КоличествоТонн = Стр.КоличествоТонн;
			ТекСтр.ИдСтроки = Стр.ИдСтроки;
			ТекСтр.Реестр   = ссылка;
			ТекСтр.ГруппаДорог   = ГруппаДорог;
			ТекСтр.Груз          = Груз;
			ТекСтр.Номенклатура = ССылка.Услуга;
			Если ЗначениеЗаполнено(Контрагент) Тогда
				ТекСтр.Контрагент = Контрагент;
				ТекСтр.ЦехКонтрагента = Стр.ЦехКонтрагента;
				ТекСтр.Объем = Стр.Объем;
				ТекСтр.Услуга1 = 0;
			КонецеСЛИ;
			
			Состояние(Обк);
			Если Обк.Проведен ТОгда
				Обк.Записать(РежимЗаписиДокумента.Проведение);
			ИНаче
				Обк.Записать(РежимЗаписиДокумента.Запись);
			КонецеСЛИ;
		КонецЦИкла;
		
КонецПроцедуры
	
Функция СткШапка()
	
	Стк = Новый Структура;
	
	Грузополучатель = Контрагент;
	Грузоотправитель = Организация;
	
	// лицевая
	Стк.Вставить("Дата",Дата);
	Стк.Вставить("ТекДата",Формат(Дата,"ДФ=dd.MM.yyyy"));
	
	Стк.Вставить("ГрузополучательПредставление1",ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Грузополучатель, Дата), "ПолноеНаименование,ИНН"));
	Стк.Вставить("ГрузополучательПредставление2",ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Грузополучатель, Дата), "ЮридическийАдрес"));
	
	Стк.Вставить("ГрузоотправительПредставление1",ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Грузоотправитель, Дата), "ПолноеНаименование,ИНН"));
	Стк.Вставить("ГрузоотправительПредставление2",ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Грузоотправитель, Дата), "ЮридическийАдрес"));
	
	Стк.Вставить("Груз", СокрлП(Груз));
	
	Стк.Вставить("АдресПогрузкиПредставление",СокрЛП(АдресОтправления));
	
	Стк.Вставить("ПеревозчикПредставление1",Стк.ГрузоотправительПредставление1);
	Стк.Вставить("ПеревозчикПредставление2",Стк.ГрузоотправительПредставление2);
	
	С = уатОбщегоНазначенияТиповые.ДанныеФизЛица(Организация,АдресОтправления.Ответсвенный,Дата);
	Стк.Вставить("СдалФИО",С.Представление);
	Стк.Вставить("Сдал",""+С.Фамилия+" "+С.Имя+" "+С.Отчество);
	
	Выборка = Справочники.КонтактныеЛицаКонтрагентов.Выбрать(,Контрагент);
	Если Выборка.Следующий() Тогда
		Стк.Вставить("Принял",СокрлП(ВЫборка.Наименование));
		Стк.Вставить("ПринялДлж",СокрлП(ВЫборка.Должность));
		Стк.Вставить("ПринялДов",СокрлП(ВЫборка.Комментарий));
	КонецеСЛИ;
	
	Возврат Стк;
	
КонецФункции

// Формирует печатную форму транспортной накладной
//
Функция уатПечатьТранспортнаяНакладная(ТекСтрока,ТабДокумент=Неопределено) Экспорт
	
	Если ТипЗнч(ТабДокумент) <> Тип("ТабличныйДокумент") Тогда		
		ТабДокумент = Новый ТабличныйДокумент;
	КонецеСЛИ;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТранспортнаяНакладная";
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	
	Если Не уатОбщегоНазначенияТиповые.ПроверитьМодифицированность(ЭтотОбъект)  Тогда
		Возврат ТабДокумент;
	КонецЕсли;
	
	
	
	ПутЛист = ТекСтрока.ПутевойЛист;
	СткШапка = СткШапка();
	ФИОВод = уатОбщегоНазначения.уатФИОФизЛица(ПутЛист.Водитель1.ФизЛицо);

	
	Макет = ПолучитьМакет("ТранспортнаяНакладная");
	ОбластьЛицевая = Макет.ПолучитьОбласть("Лицевая");
	ОбластьОборотная  = Макет.ПолучитьОбласть("Оборотная");
	
	// лицевая
	
	ОбластьЛицевая.Параметры.Заполнить(СткШапка);
	ОбластьЛицевая.Параметры.НомерТТН = "021/"+СокрлП(ПутЛист.Номер)+"-"+СокрлП(ТекСтрока.НомерСтроки);
	ОбластьЛицевая.Параметры.АдресРазгрузкиПредставление = ТекСтрока.ЦехКонтрагента;
	ОбластьЛицевая.Параметры.Объем = ""+ТекСтрока.ОБъем+" м3";
	ОбластьЛицевая.Параметры.Время = ТекСтрока.ВремяПрибытия;
	Если НЕ ФИОВод = Неопределено Тогда
		ОбластьЛицевая.Параметры.ВодительФИО = ФИОВод.Фамилия + " " + Лев(ФИОВод.Имя, 1) + "." + Лев(ФИОВод.Отчество, 1);
	КонецесЛИ;
	
	// оборотная
	ОбластьОборотная.Параметры.Заполнить(СткШапка);
	
	ОбластьОборотная.Параметры.ПеревозчикПредставление4 = "Путевой лист №" + ПутЛист.Номер+" от "+Формат(ПутЛист.Дата,"ДФ=dd.MM.yyyy")+" г.";
	
	Если НЕ ФИОВод = Неопределено Тогда
		ОбластьОборотная.Параметры.Водитель = ФИОВод.Фамилия + " " + ФИОВод.Имя + " " + ФИОВод.Отчество;
	КонецЕсли;
	
	ОбластьОборотная.Параметры.ТСХарактеристикиПредставление1 = СокрЛП(ПутЛист.ТранспортноеСредство);
	ОбластьОборотная.Параметры.ТСПредставление1 = "Гос.№ "+СокрЛП(ПутЛист.ТранспортноеСредство.ГосударственныйНомер);
	
	
	
	ТабДокумент.Вывести(ОбластьЛицевая);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	ТабДокумент.Вывести(ОбластьОборотная);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	Возврат ТабДокумент;
КонецФункции	

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	ПРефикс ="0";
КонецПроцедуры
